app/controllers/artists_controller.rb

SELECT * FROM "artists" WHERE ("artists"."id" = 0)
---
  def show
    @artist = Artist.find params[:id]

INSERT INTO "albums" ("name", "pf_score", "created_at", "pf_date", "updated_at", "is_enabled", "year", "pf_url", "artwork_url", "record_label", "artist_id") VALUES('IRM', 8.4, '2010-02-08 02:17:40', 'January 28, 2010', '2010-02-08 02:17:40', 't', 2009, 'http://www.pitchfork.com/reviews/albums/13878-irm/', 'http://cdn.pitchfork.com/media/irm200_.jpg', 'Because', 265)
INSERT INTO "artists" ("name", "created_at", "updated_at", "is_enabled", "url_name") VALUES('Charlotte Gainsbourg', '2010-01-29 00:56:56', '2010-01-29 00:56:56', 't', 'charlotte+gainsbourg')
SELECT "artists".id FROM "artists" WHERE ("artists"."name" = 'Charlotte Gainsbourg') LIMIT 1
SELECT "albums".id FROM "albums" WHERE ("albums"."name" = 'IRM') LIMIT 1
---
  def load
    require 'rubygems'
    require 'hpricot'
    require 'open-uri'
    @new_album = Album.new
       @new_album.id = 0
       @new_album.artist_id = 0
       @new_album.name = "No Album Found"
       @new_album.is_enabled = true
       @new_album.pf_score = 0
       @new_album.pf_url = "http://www.pitchfork.com"
       @new_album.artwork_url = "/images/no-artwork.jpg"
       @new_album.record_label = "No Label Found"
       @new_album.year = 2010
    @new_album.save
    @artists = []
    11.times do |i|
      if i > 0
        page = Hpricot(open('http://pitchfork.com/reviews/best/albums/' + i.to_s))
        items = page.search("//div[@class='panel']//div[@class='panel']").each do |panel|
          pp panel
          #find artist name and save
          artist_name = panel.search("//span[@class='artists']/a/b").inner_html
          album_name = panel.search("//span[@class='albums']/a").inner_html