app/controllers/pages_controller.rb

  def prev_track
    @track =  Track.find params[:id]
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 1)

  def next_track
    @track = Track.random()
    @track.play_count = @track.play_count+1
    @track.save
---
UPDATE "tracks" SET "updated_at" = '2010-02-08 02:54:27', "play_count" = 1 WHERE "id" = 14