app/controllers/tracks_controller.rb

SELECT * FROM "artists" WHERE (id = 1) LIMIT 1
SELECT * FROM "artists"
---
  def import
    require 'Base64'
    require 'rest_client'
    require 'json'
    @success = []
    creds = 'niwCFilfWCZqF' + ':' + '0c8e7f31519d0b9d576405e0cb4f0b037fcfa4ec'
    url = 'http://' + creds + '@api.8tracks.com/'
    playtoken_r = RestClient.get url + '/sets/new.json',
      :headers => {
        :content_type => 'text/xml',
      }
    j = JSON.parse(playtoken_r)
    playtoken = j['play_token']
    @playtoken = playtoken
    if params[:id] != nil     #This imports tracks based on an artist ID
      id = params[:id].to_i
      conditions = 'id = ' + id.to_s
      artist = Artist.find(:first, :conditions => conditions)

      mix_r = RestClient.get url + 'mixes.json?per_page=50&q=' + artist.url_name + '&sort=recent'

SELECT * FROM "albums" WHERE (name = "The Best Of The Cool, The Crazy, The Fabulous Flaming Lips!") LIMIT 1
---
              @new_track.play_count = 0
              @new_track.artist_id = id #album.artist_id
              conditions = 'name = "' + tracks_arr['track']['album'] + '"'
              album = Album.find(:first, :conditions=> conditions)

INSERT INTO "tracks" ("name", "created_at", "album_id", "updated_at", "mp3_url", "play_count", "artist_id") VALUES('L''un part l''autre reste', '2010-01-29 00:58:10', 0, '2010-01-29 00:58:10', 'http://8tracks.s3.amazonaws.com/tf/000/566/322/25634.mp3', 0, 1)
---
              else
                @new_track.album_id = 0
              end
              @new_track.save